<a href="https://colab.research.google.com/github/Maurilio-Neto/Imersao_Alura_dados_em_python/blob/main/Imers%C3%A3o_dados_python_Alura.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [66]:
import pandas as pd
# Importando uma biblioteca e atribuindo um nome para ela no meu código

In [67]:
df = pd.read_csv(
    "https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv"
    )
# Novo bloco de código para importação da base de dados (df: data frame)

In [68]:
df.head()
# Visualização do data frame (df) leitura das primeiras linhas do df, é possível
# indicar quantas linhas desejamos ver dentro do parênteses

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [69]:
df.info()
# Mostra algumas informações das colunas do df, como nome, tipo de variável, etc

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [70]:
df.describe()
# Mostra medidas estatísticas descritivas das variáveis, como média, quartis,
# desvio padrão, amplitude e nº de oservações

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [71]:
df.shape
# (nº linhas, nº colunas)
# o valor abaixo é tratado como um vetor, assim como no R, em que o primeiro
# valor é o numero de linhas e o segundo o número de colunas

(133349, 11)

In [72]:
linhas, colunas = df.shape[0], df.shape[1]
# Cria duas variáveis de acordo com o vetor do df.shape (133349, 11), ou seja,
# linhas = 1º valor do vetor df.shape
# colunas = 2º valor do vetor df.shape
print("Linhas:", linhas)
print("Colunas:", colunas)

Linhas: 133349
Colunas: 11

In [73]:
df.columns
# Mostra os nomes das colunas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [74]:
renomear_colunas = {
    'work_year': 'ano',
    'experience_level': 'senioridade',
    'employment_type': 'contrato',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda',
    'salary_in_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'remoto',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}
# Define uma nova variável que possui um conjunto de nome definidos e depois é
# utilizada na função .rename para substituir os nomes indicados pelos nomes
# definidos

df.rename(columns=renomear_colunas, inplace=True)
df.columns

Index(['ano', 'senioridade', 'contrato', 'cargo', 'salario', 'moeda', 'usd',
       'residencia', 'remoto', 'empresa', 'tamanho_empresa'],
      dtype='object')

In [75]:
df["senioridade"].value_counts()
# Comando para contar as frequências de cada categoria de uma coluna do data
# frame
# Legenda:
# SE: Sênior
# MI: Mid (Pleno)
# EN: Entry (Júnior)
# EX: Executive (Executivo)

senioridade
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [76]:
senioridade = {
    'SE': 'Sênior',
    'MI': 'Pleno',
    'EN': 'Júnior',
    'EX': 'Executivo'
}

df["senioridade"] = df["senioridade"].replace(senioridade)
df["senioridade"].value_counts()

senioridade
Sênior       77241
Pleno        40465
Júnior       12443
Executivo     3200
Name: count, dtype: int64

In [77]:
df["contrato"].value_counts()
# Legenda:
# FT: Full Time (Tempo integral)
# CT: Temporary contract (Contrato)
# PT: Part time (Tempo parcial)
# FL: Freelance

contrato
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [78]:
contrato = {
    'FT': 'Tempo integral',
    'CT': 'Contrato',
    'PT': 'Tempo parcial',
    'FL': 'Freelance'
}

df["contrato"] = df["contrato"].replace(contrato)
df["contrato"].value_counts()

contrato
Tempo integral    132563
Contrato             394
Tempo parcial        376
Freelance             16
Name: count, dtype: int64

In [79]:
df["remoto"].value_counts()
# Legenda
# 0: Trabalhos presenciais
# 100: Remoto
# 50: Híbrido

remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [80]:
remoto = {
    0: 'Trabalhos presenciais',
    100: 'Remoto',
    50: 'Híbrido'
}

df['remoto'] = df['remoto'].replace(remoto)
df['remoto'].value_counts()

remoto
Trabalhos presenciais    105312
Remoto                    27718
Híbrido                     319
Name: count, dtype: int64

In [81]:
df["tamanho_empresa"].value_counts()
# Legenda
# M: Medium
# L: Large
# S: Small

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [82]:
tamanho_empresa = {
    'M': 'Médio',
    'L': 'Grande',
    'S': 'Pequeno'
}

df['tamanho_empresa'] = df['tamanho_empresa'].replace(tamanho_empresa)
df['tamanho_empresa'].value_counts()

tamanho_empresa
Médio      129561
Grande       3574
Pequeno       214
Name: count, dtype: int64

In [83]:
df["cargo"].value_counts()

cargo
Data Scientist                     17314
Software Engineer                  15007
Data Engineer                      14868
Data Analyst                       12381
Engineer                            9456
                                   ...
Quantitative Research Analyst          1
Data Science Tech Lead                 1
Staff Machine Learning Engineer        1
Principal Data Architect               1
Cloud Data Architect                   1
Name: count, Length: 390, dtype: int64

In [84]:
df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Sênior,Tempo integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio
1,2025.0,Sênior,Tempo integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio
2,2025.0,Pleno,Tempo integral,Data Engineer,158800,USD,158800,AU,Trabalhos presenciais,AU,Médio
3,2025.0,Pleno,Tempo integral,Data Engineer,139200,USD,139200,AU,Trabalhos presenciais,AU,Médio
4,2025.0,Júnior,Tempo integral,Data Engineer,90000,USD,90000,US,Trabalhos presenciais,US,Médio

In [85]:
df.describe(include='object')

,senioridade,contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Sênior,Tempo integral,Data Scientist,USD,US,Trabalhos presenciais,US,Médio
freq,77241,132563,17314,126140,119579,105312,119641,129561

In [86]:
df.describe()

                 ano       salario            usd
count  133339.000000  1.333490e+05  133349.000000
mean     2024.358770  1.632833e+05  157617.272098
std         0.680627  2.173860e+05   74288.363097
min      2020.000000  1.400000e+04   15000.000000
25%      2024.000000  1.060200e+05  106000.000000
50%      2024.000000  1.470000e+05  146206.000000
75%      2025.000000  1.990000e+05  198000.000000
max      2025.000000  3.040000e+07  800000.000000